# Напишіть функцію, що приймає два аргументи. Функція повинна
# якщо аргументи відносяться до числових типів - повернути різницю цих аргументів,
# якщо обидва аргументи це строки - обʼєднати в одну строку та повернути
# якщо перший строка, а другий ні - повернути dict де ключ це перший аргумент, а значення - другий
# у будь-якому іншому випадку повернути кортеж з цих аргументів


def arg_checker(arg1, arg2):
    if arg1 and arg2 == int or float:
        return arg1 - arg2
    elif arg1 and arg2 == str:
        return arg1 + arg2
    elif arg1 == str and arg2 != str:
        return {arg1,arg2}


print(arg_checker("asd", 55))