# Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:
#
# # Попросіть користувача ввести свсвій вік (можно використати константу або input()).
#
# - якщо користувачу менше 7 - вивести "Де твої батьки?"
#
# - якщо користувачу менше 16 - вивести "Це фільм для дорослих!"
#
# - якщо користувачу більше 65 - вивести "Покажіть пенсійне посвідчення!"
#
# - якщо вік користувача складається з однакових цифр (11, 22, 44 і тд років, всі можливі варіанти!) -
#   вивести "Який цікавий вік!"
#
# - у будь-якому іншому випадку - вивести "А білетів вже немає!"


while True:
    try:
        customer_age = int(input('Введіть, будь ласка, ваш вік у числовому форматі:\n'))
        value = int(customer_age)
        if value > 0:
            break
        else:
            print('Число мусить бути більше нуля, спробуйте ще раз')
    except ValueError:
        print('Введіть, будь ласка, ваш вік цифрами')

if len(str(customer_age)) > 1:
    if str(customer_age) == len(str(customer_age)) * str(customer_age)[0]:
        print('Який цікавий вік!')

if customer_age < 7:
    print('Де твої батьки?')

elif customer_age < 16:
    print('Це фільм для дорослих!')

elif customer_age > 65:
    print('Покажіть пенсійне посвідчення!')

else:
    print('А білетів вже немає!')
